<template>
  <div>
    <h2>
      Забота о животных вместе с
      <span class="text-green">Zoo.com.ua (SEO)</span>
    </h2>
    <p class="mt-7">
      Интернет-магазин "Zoo.com.ua" доставляет продукты к вам домой, в офис, на
      дачу, а вы экономите время и силы. Мы внимательно следим за сроками
      годности, поэтому гарантируем свежесть товара, который вы приобретаете.
      <br />
      В нашем интернет-магазине вы можете купить все самые необходимые продукты
      питания на каждый день и для особых случаев, готовые блюда, напитки,
      товары для гигиены и быта. Все заказы мы привозим с собственного
      оборудованного склада, который ежедневно пополняется товарами от надежных
      поставщиков. <br />
      У нас регулярно проходят акции на весь ассортимент. Также вы можете
      экономить, оформив пластиковую или виртуальную карту Клуба "Перекресток".
      Доставляем заказы в Москве и области день в день или на следующий день
      после заказа. Есть возможность бесплатной доставки. Сделайте покупку через
      сайт или мобильное приложение: зарегистрируйтесь, выберете продукты и
      положите их в корзину, укажите адрес, временной интервал и способ оплаты.
      Статус заказа можно отслеживать онлайн. Курьер позвонит вам заранее,
      поднимет ваши продукты до квартиры и поставит пакеты туда, куда вы
      скажете. До оплаты вы имеете право отказаться от любого товара, даже если
      он уже привезен. После оплаты курьер предоставит вам кассовый и товарный
      чеки.
    </p>
    <p class="mt-5">
      <i class="font-italic font-bold"> Мы будем рады видеть вас в числе наших постоянных клиентов!</i>
    </p>
  </div>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'

export default defineComponent({
  setup() {
    return {}
  },
})
</script>

<style lang="postcss">
</style>