<template>
  <div class="product-info-delivery">
    <TextContent :text="content"> </TextContent>
  </div>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'

export default defineComponent({
  setup() {
    const content = `<div>
        Самовывоз:  есть возможность забрать товар по адресу: г.Киев, ул.Бориспольская, 26-Б. Работаем  с ПН-ПТ с 9.00 до 18.00 . Обратите внимание, что в нашем шоуруме не весь ассортимент, представленный на сайте, наличие уточняйте. Телефон (097)444-87-00, (095) 444-87-00

Доставка по Киеву<br>
<br>
Заказы принимаем 7 дней в неделю. Обработка заказов с ПН-ПТ с 8.30 до 19.00. При наличии товара заказ отправляется в тот же день. <br>
Мы стараемся доставить товар в максимально удобные и короткие сроки <br>
<br>
Доставка осуществляется с помощью сервиса доставки "Нова пошта" или курьерской службой<br>
<br>
Доставка возможна как до отделения, так и по точному адресу<br>
<br>
Доставка по Дарницкому району бесплатная!<br>
<br>
Стоимость доставки     

 Доставка курьером по Киеву - 50 грн,  от 500 грн бесплатно<br>
 Доставка "Нова пошта" - от 800 грн бесплатно, в случае стоимости заказа до 800 грн - оплата за счет покупателя<br>
 Приятный бонус!  Бесплатная доставка по левому берегу и -50% на доставку по правому, при оформлении "регулярного заказа"<br>
 <br>
 Оплата заказа
<br>
Наличными курьеру<br>
Перевод на карту Приватбанка <br>
На банковский счет<br>
Наложенным платежом<br>
Оплата заказа осуществляется после подтверждения менеджером наличия товара    <br>       
Для того чтоб оплатить Ваш заказ в безналичной форме, пожалуйста переведите общую сумму за заказ на расчетный счет нашего предприятия: р/с UA113052990000026009026213950 или на карту предприятия открытую в Приватбанке 5169 3305 1892 0480. Предприниматель ФОП Максюта Р.В. В комментарии укажите ФИО и назначение платежа.<br>
<br>
Если на нашем сайте отсутствует способ оплаты, который будет Вам удобен, свяжитесь с нами и опишите наиболее приемлемый способ оплаты для Вас. Мы сделаем всё зависящее от нас, чтобы этот способ в максимально короткий срок появился на нашем сайте.<br>
<br>
Заказ не будет обработан, пока деньги не поступят на наш расчетный счет.<br>
<br>
  Доставка по Киевской области и Украине<br>
<br>
       Сроки доставки по Киевской области и Украине с момента отправки 1-3 дня, в зависимости от удаленности населенного пункта<br>
<br>
       Доставка по Киевской области и Украине работает через сервисы :<br>

  Нова пошта<br>
  Укрпошта<br>
  Оплата заказа<br>
<br>
Наличными курьеру<br>
Перевод на карту Приватбанка <br>
На банковский счет<br>
Наложенным платежом<br>
Оплата заказа осуществляется после подтверждения менеджером наличия товара    <br>                                                                                                                                                           
Для того чтоб оплатить Ваш заказ в безналичной форме, пожалуйста переведите общую сумму за заказ на расчетный счет нашего предприятия: р/с UA063007110000026002052681221 или на карту предприятия открытую в Приватбанке 5169 3305 1892 0480. Предприниматель ФОП Максюта Р.В. В комментарии укажите ФИО и назначение платежа.<br>
<br>
Если на нашем сайте отсутствует способ оплаты, который будет Вам удобен, свяжитесь с нами и опишите наиболее приемлемый способ оплаты для Вас. Мы сделаем всё зависящее от нас, чтобы этот способ в максимально короткий срок появился на нашем сайте.<br>
<br>
<br>
Заказ не будет обработан, пока деньги не поступят на наш расчетный счет.</div>`
    return { content }
  },
})
</script>

<style lang="postcss">
.product-description {
}
</style>