<template>
  <div class="blog-post-content">
    <BlogPostAnotation class="!mb-14 sm:!mb-9" />
    <TextContent :text="content" />
    <div>
      <h2>Что нужно учитывать, выбирая имя для щенка?</h2>
      <p>
        Опытные кинологи советуют при выборе имени придерживаться некоторых
        рекомендаций. Они помогут подобрать подходящую кличку, к которой будет
        легко приучить любимца.
      </p>
    </div>
    <div>
      <h2>Выбирайте имя, которое заканчивается на согласную</h2>
      <p>
        Собаки не различают смысла слов, но хорошо понимают интонации, потому
        что тонко чувствуют частоту звуков. Вам будет легче привлечь внимание
        любимца, если его имя заканчивается гласной. Примеры таких имён: Майло,
        Лилу, Мия, Тео.
      </p>
    </div>
    <div>
      <h2>Избегайте длинных имён</h2>
      <p>
        Лучше всего выбирать имя, в котором будет два—три слога. Например, Бинго
        или Лёля. Если решили назвать щенка длинным именем, попробуйте
        произнести это имя так, как будто вы зовёте собаку. Допустим, вы хотите
        назвать питомца Арчибальдом. Скорее всего, вам будет не очень комфортно
        подзывать собаку таким длинным именем во время прогулки. Велика
        вероятность, что такую кличку вы сократите до «Арчи». Если очень хочется
        оставить длинное имя, щенка лучше сразу приучать к укороченному
        варианту, а полное имя оставить для документов.
      </p>
    </div>
    <div>
      <h2>Имя не должно быть созвучно с командами</h2>
      <p>
        Подумайте, не звучит ли выбранное имя как команда? Например, «Изя»
        созвучно с командой «Нельзя». Собака будет путаться: это вы её зовете
        или запрещаете что-то? Кличка не должна вызывать у собаки недоумение.
      </p>
    </div>
    <div>
      <h2>Имена любимцев не должны быть похожи</h2>
      <p>
        Если у вас уже есть питомец, выбирайте щенку такую кличку, которая не
        будет похожа на имя другого питомца. Например, Веня и Сеня — не очень
        хороший выбор имён, они похожи и собаки будут путаться, кого из них вы
        зовёте. Хорошая пара имён — Умка и Сима.
      </p>
    </div>
    <div>
      <h2>Где брать идеи для имени?</h2>
      <p>
        Некоторые люди понимают, как хотят назвать щенка, уже после первой
        встречи с будущим любимцем. У других же подбор имени вызывает трудности.
        Вот несколько идей, которые помогут придумать щенку имя.
      </p>
      <ul class="checmark-list">
        <li>
          Внешний вид может подсказать много вариантов имени. Какой у щенка цвет
          шерсти? Может, есть особая примета в виде пятна на мордочке или на
          теле? Собаку с золотистой шерстью можно назвать Голди, с серой — Грея
          или Туман, чёрно-белую — Домино. Вариантов много, нужно только
          присмотреться.
        </li>
        <li>
          Называя щенка, можно отталкиваться от его породы. Например, можно
          отталкиваться от того, где вывели породу. Собаку английской породы
          можно назвать Леди, а северной породы — Тундрой.
        </li>
        <li>
          Характер щенка тоже может подсказать подходящее имя. К примеру,
          активного щенка можно назвать Стрелкой или Искрой. Чтобы понять
          характер питомца, расспросите заводчика или дайте щенку время на
          адаптацию в новом доме.
        </li>
        <li>
          Можно назвать щенка в честь любимого героя из книги, фильма или
          сериала. Или в честь питомца любимой знаменитости. Майло, Лэсси,
          Балто, Белка, Гуфи, Оди — это только некоторые из имён кинособак
        </li>
      </ul>
    </div>
    <div>
      <h2>Что нужно помнить об имени щенка?</h2>
      <p>
        Перед тем, как начать приучать щенка к имени, стоит запомнить, что имя —
        уже своего рода команда. Поэтому у имени может быть только одно
        значение. Называя собаку по кличке, владелец хочет обратить её внимание
        на себя. То есть собака должна прекратить делать то, что она делает в
        данный момент, и посмотреть на владельца. Когда она это сделает, можно
        давать следующую команду. Поэтому имя собаки не должно звучать в паре с
        другой командой: «Арчи, сидеть!» Сначала нужно позвать собаку: «Арчи!»,
        и, когда она обратит на вас внимание, дать команду «Сидеть!»
      </p>
      <p>
        Ещё один нюанс: нельзя, чтобы имя собаки ассоциировалось у неё с чем-то
        плохим. Чтобы собака всегда отзывалась на своё имя, с детства стоит
        следить за тем, чтобы все звали собаку со спокойной и уверенной
        интонацией. Если собака делает что-то, что делать нельзя, не используйте
        имя, чтобы её ругать. Вместо «Арчи, прекрати! Арчи, нельзя!» скажите
        просто «Нельзя!». Если кличка будет ассоциироваться у собаки с тем, что
        вы её ругаете, она перестанет отзываться, потому что в ней заложена
        такая цепочка: меня зовут, значит, будут ругать, а я этого не хочу,
        поэтому не буду отзываться.
      </p>
      <p>Всё это нужно помнить, когда будете приучать щенка к имени.</p>
    </div>
  </div>
</template>

<script lang="ts">
import { defineComponent } from '@nuxtjs/composition-api'
const content = `
  
`
export default defineComponent({
  setup() {
    return { content }
  },
})
</script>

<style lang="postcss">
.blog-post-content {
   @apply font-medium;
  h2 {
    @apply mb-4.5;
  }
  p {
    @apply text-lg mb-2 xl:text-base sm:text-sm;
  }
  > div {
    @apply mb-7;
  }
}
</style>